## 📝 Terraform Plan Result (dev)

```terraform
module.bastion_dev_sg.aws_security_group_rule.ingress_cidr["0"]: Refreshing state... [id=sgrule-3098698296]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["3"]: Refreshing state... [id=sgrule-1194359448]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["1"]: Refreshing state... [id=sgrule-2943073778]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["0"]: Refreshing state... [id=sgrule-3276909209]
module.was_dev_sg.aws_security_group_rule.ingress_cidr["2"]: Refreshing state... [id=sgrule-4055508781]
module.bastion_dev_sg.aws_security_group.main: Refreshing state... [id=sg-07de8c1a202bd8632]
module.was_dev.aws_eip_association.main[0]: Refreshing state... [id=eipassoc-02689738aab8b8240]
module.bastion_dev.aws_instance.main: Refreshing state... [id=i-0990c945e761cdec6]
module.was_dev_sg.aws_security_group.main: Refreshing state... [id=sg-08d12b3a96ab9c2f1]
module.was_dev.aws_instance.main: Refreshing state... [id=i-0bcf161d291cb449d]
module.was_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-531428030]
module.bastion_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-918922030]
module.rds_mysql.aws_db_parameter_group.main: Refreshing state... [id=cherrypic-mysql-parameter-group]
data.aws_ami.ubuntu_latest: Reading...
module.eip_was.aws_eip.main: Refreshing state... [id=eipalloc-0dcd414bd0f84fe86]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-057adc9a1eada1de9]
data.aws_ami.ubuntu_latest: Read complete after 0s [id=ami-00bbf0eabfaee75db]
module.private_subnet_2.aws_subnet.main: Refreshing state... [id=subnet-0f52437b2467db9e5]
module.private_subnet_1.aws_subnet.main: Refreshing state... [id=subnet-0954ef8a15a2713c1]
module.cache_dev_sg.aws_security_group.main: Refreshing state... [id=sg-07b667f240dcf3872]
module.internet_gateway.aws_internet_gateway.main: Refreshing state... [id=igw-07a84e87099bfca5f]
module.public_route_table.aws_route_table.main: Refreshing state... [id=rtb-0b227b5ee413e49a1]
module.public_subnet_2.aws_subnet.main: Refreshing state... [id=subnet-01db3e4fc3993cb65]
module.db_dev_sg.aws_security_group.main: Refreshing state... [id=sg-0152683282f8bb08c]
module.private_route_table.aws_route_table.main: Refreshing state... [id=rtb-035dc66d49319e396]
module.public_subnet_1.aws_subnet.main: Refreshing state... [id=subnet-057da2c4681ade9a7]
module.public_route_table.aws_route.igw[0]: Refreshing state... [id=r-rtb-0b227b5ee413e49a11080289494]
module.cache_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-4032836028]
module.cache_dev_sg.aws_security_group_rule.ingress_sg["1"]: Refreshing state... [id=sgrule-4122072874]
module.cache_dev_sg.aws_security_group_rule.ingress_sg["0"]: Refreshing state... [id=sgrule-3477390192]
module.db_dev_sg.aws_security_group_rule.ingress_sg["1"]: Refreshing state... [id=sgrule-1940400422]
module.db_dev_sg.aws_security_group_rule.ingress_sg["0"]: Refreshing state... [id=sgrule-1230847356]
module.db_dev_sg.aws_security_group_rule.egress["0"]: Refreshing state... [id=sgrule-2073235641]
module.private_subnet_1.aws_route_table_association.main: Refreshing state... [id=rtbassoc-03032bb2f172435ef]
module.public_subnet_2.aws_route_table_association.main: Refreshing state... [id=rtbassoc-083b8b88bc09a339c]
module.private_subnet_2.aws_route_table_association.main: Refreshing state... [id=rtbassoc-04e784358d4a7f289]
module.public_subnet_1.aws_route_table_association.main: Refreshing state... [id=rtbassoc-01cdad2d0a5bda93f]
module.rds_mysql.aws_db_subnet_group.main: Refreshing state... [id=cherrypic-mysql-subnet-group]
module.cache_dev.aws_elasticache_subnet_group.main: Refreshing state... [id=cherrypic-cache-subnet-group]
module.rds_mysql.aws_db_instance.main: Refreshing state... [id=db-VWJ6TRMLIRQP7N5ISOWOU7IPGQ]
module.cache_dev.aws_elasticache_replication_group.main: Refreshing state... [id=cherrypic-cache-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.api_dev.aws_eip_association.main[0] will be created
  + resource "aws_eip_association" "main" {
      + allocation_id        = "eipalloc-0dcd414bd0f84fe86"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.api_dev.aws_instance.main will be created
  + resource "aws_instance" "main" {
      + ami                                  = "ami-0436f6f455f7b550f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "cherrypic-api-dev-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-057da2c4681ade9a7"
      + tags                                 = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cherrypic-api-dev"
          + "Team"        = "backend"
        }
      + tags_all                             = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "cherrypic-api-dev"
          + "Team"        = "backend"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp2"
        }
    }

  # module.api_dev_sg.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "API Server Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "api-dev-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "api-dev-sg"
          + "Team"        = "backend"
        }
      + tags_all               = {
          + "App"         = "cherrypic"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "api-dev-sg"
          + "Team"        = "backend"
        }
      + vpc_id                 = "vpc-057adc9a1eada1de9"
    }

  # module.api_dev_sg.aws_security_group_rule.egress["0"] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.api_dev_sg.aws_security_group_rule.ingress_cidr["0"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.api_dev_sg.aws_security_group_rule.ingress_cidr["1"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.api_dev_sg.aws_security_group_rule.ingress_cidr["2"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.api_dev_sg.aws_security_group_rule.ingress_cidr["3"] will be created
  + resource "aws_security_group_rule" "ingress_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.bastion_dev.aws_instance.main will be destroyed
  # (because aws_instance.main is not in configuration)
  - resource "aws_instance" "main" {
      - ami                                  = "ami-06af2834df25fe45d" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-2:805472282514:instance/i-0990c945e761cdec6" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "ap-northeast-2a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0990c945e761cdec6" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "stopped" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "cherrypic-bastion-host-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0ab0a12888e938e03" -> null
      - private_dns                          = "ip-10-0-1-49.ap-northeast-2.compute.internal" -> null
      - private_ip                           = "10.0.1.49" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-057da2c4681ade9a7" -> null
      - tags                                 = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "cherrypic-bastion-host"
          - "Team"        = "backend"
        } -> null
      - tags_all                             = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "cherrypic-bastion-host"
          - "Team"        = "backend"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-07de8c1a202bd8632",
        ] -> null
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0ba6f18c868d719f8" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.bastion_dev_sg.aws_security_group.main will be destroyed
  # (because aws_security_group.main is not in configuration)
  - resource "aws_security_group" "main" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:805472282514:security-group/sg-07de8c1a202bd8632" -> null
      - description            = "Bastion Host Security Group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-07de8c1a202bd8632" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "bastion-host-sg" -> null
      - owner_id               = "805472282514" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "bastion-host-sg"
          - "Team"        = "backend"
        } -> null
      - tags_all               = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "bastion-host-sg"
          - "Team"        = "backend"
        } -> null
      - vpc_id                 = "vpc-057adc9a1eada1de9" -> null
        # (1 unchanged attribute hidden)
    }

  # module.bastion_dev_sg.aws_security_group_rule.egress["0"] will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-918922030" -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-07de8c1a202bd8632" -> null
      - security_group_rule_id = "sgr-03a742b10a04e0f82" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.bastion_dev_sg.aws_security_group_rule.ingress_cidr["0"] will be destroyed
  # (because aws_security_group_rule.ingress_cidr is not in configuration)
  - resource "aws_security_group_rule" "ingress_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-3098698296" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-07de8c1a202bd8632" -> null
      - security_group_rule_id = "sgr-05ea43b4e39471012" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cache_dev_sg.aws_security_group_rule.ingress_sg["0"] must be replaced
-/+ resource "aws_security_group_rule" "ingress_sg" {
      ~ id                       = "sgrule-3477390192" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0970aeecc6e1b40b3" -> (known after apply)
      ~ source_security_group_id = "sg-07de8c1a202bd8632" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.cache_dev_sg.aws_security_group_rule.ingress_sg["1"] will be destroyed
  # (because key ["1"] is not in for_each map)
  - resource "aws_security_group_rule" "ingress_sg" {
      - from_port                = 6379 -> null
      - id                       = "sgrule-4122072874" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-07b667f240dcf3872" -> null
      - security_group_rule_id   = "sgr-0d82c811f858e5c07" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-08d12b3a96ab9c2f1" -> null
      - to_port                  = 6379 -> null
      - type                     = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.db_dev_sg.aws_security_group_rule.ingress_sg["0"] must be replaced
-/+ resource "aws_security_group_rule" "ingress_sg" {
      ~ id                       = "sgrule-1230847356" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0332df3d51007417d" -> (known after apply)
      ~ source_security_group_id = "sg-08d12b3a96ab9c2f1" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.db_dev_sg.aws_security_group_rule.ingress_sg["1"] will be destroyed
  # (because key ["1"] is not in for_each map)
  - resource "aws_security_group_rule" "ingress_sg" {
      - from_port                = 3306 -> null
      - id                       = "sgrule-1940400422" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0152683282f8bb08c" -> null
      - security_group_rule_id   = "sgr-0f24f048ede8e9099" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-07de8c1a202bd8632" -> null
      - to_port                  = 3306 -> null
      - type                     = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.was_dev.aws_eip_association.main[0] will be destroyed
  # (because aws_eip_association.main is not in configuration)
  - resource "aws_eip_association" "main" {
      - allocation_id        = "eipalloc-0dcd414bd0f84fe86" -> null
      - id                   = "eipassoc-02689738aab8b8240" -> null
      - instance_id          = "i-0bcf161d291cb449d" -> null
      - network_interface_id = "eni-05903426cf6c61c1a" -> null
      - private_ip_address   = "10.0.1.192" -> null
      - public_ip            = "54.180.66.98" -> null
    }

  # module.was_dev.aws_instance.main will be destroyed
  # (because aws_instance.main is not in configuration)
  - resource "aws_instance" "main" {
      - ami                                  = "ami-08943a151bd468f4e" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-2:805472282514:instance/i-0bcf161d291cb449d" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-northeast-2a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0bcf161d291cb449d" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "cherrypic-was-dev-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-05903426cf6c61c1a" -> null
      - private_dns                          = "ip-10-0-1-192.ap-northeast-2.compute.internal" -> null
      - private_ip                           = "10.0.1.192" -> null
      - public_dns                           = "ec2-54-180-66-98.ap-northeast-2.compute.amazonaws.com" -> null
      - public_ip                            = "54.180.66.98" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-057da2c4681ade9a7" -> null
      - tags                                 = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "cherrypic-was-dev"
          - "Team"        = "backend"
        } -> null
      - tags_all                             = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "cherrypic-was-dev"
          - "Team"        = "backend"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-08d12b3a96ab9c2f1",
        ] -> null
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0a243d5bc2f7d4f7b" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.was_dev_sg.aws_security_group.main will be destroyed
  # (because aws_security_group.main is not in configuration)
  - resource "aws_security_group" "main" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:805472282514:security-group/sg-08d12b3a96ab9c2f1" -> null
      - description            = "WAS Security Group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-08d12b3a96ab9c2f1" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "was-dev-sg" -> null
      - owner_id               = "805472282514" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "was-dev-sg"
          - "Team"        = "backend"
        } -> null
      - tags_all               = {
          - "App"         = "cherrypic"
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "was-dev-sg"
          - "Team"        = "backend"
        } -> null
      - vpc_id                 = "vpc-057adc9a1eada1de9" -> null
        # (1 unchanged attribute hidden)
    }

  # module.was_dev_sg.aws_security_group_rule.egress["0"] will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-531428030" -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-08d12b3a96ab9c2f1" -> null
      - security_group_rule_id = "sgr-0cfaf7c9a1cc67396" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["0"] will be destroyed
  # (because aws_security_group_rule.ingress_cidr is not in configuration)
  - resource "aws_security_group_rule" "ingress_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 8080 -> null
      - id                     = "sgrule-3276909209" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-08d12b3a96ab9c2f1" -> null
      - security_group_rule_id = "sgr-0901b5be1558c3db1" -> null
      - self                   = false -> null
      - to_port                = 8080 -> null
      - type                   = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["1"] will be destroyed
  # (because aws_security_group_rule.ingress_cidr is not in configuration)
  - resource "aws_security_group_rule" "ingress_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-2943073778" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-08d12b3a96ab9c2f1" -> null
      - security_group_rule_id = "sgr-048c6db3c631557d8" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["2"] will be destroyed
  # (because aws_security_group_rule.ingress_cidr is not in configuration)
  - resource "aws_security_group_rule" "ingress_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-4055508781" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-08d12b3a96ab9c2f1" -> null
      - security_group_rule_id = "sgr-0b96b870bce0065fd" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

  # module.was_dev_sg.aws_security_group_rule.ingress_cidr["3"] will be destroyed
  # (because aws_security_group_rule.ingress_cidr is not in configuration)
  - resource "aws_security_group_rule" "ingress_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-1194359448" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-08d12b3a96ab9c2f1" -> null
      - security_group_rule_id = "sgr-0ed06075ea9dbe4fb" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "ingress" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 10 to add, 0 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```